# boolean  - логическая переменная
var_bool1 = True  # булевая переменная - Правда / Ложь
var_bool2 = False  # булевая переменная - Правда / Ложь

# integer - целочисленная переменная
var_int1 = 12  # целочисленная переменная
var_int2 = -10  # целочисленная переменная
var_int3 = 0  # целочисленная переменная

# float - число со знаками после запятой
var_float1 = 12.14  # число со знаками после запятой
var_float2 = -10.00  # число со знаками после запятой
var_float3 = 0.0  # число со знаками после запятой

# string - символьный(строковый) тип данных
var_str1 = ""  # пустая строка
var_str2 = "Иван!@!224efdw"  # строка с определёнными данными
var_str3 = "12"  # строка с определёнными данными
var_str4 = 'Bogdan'  # строка с определёнными данными
var_str5 = "The're"  # строка с определёнными данными, с использование кавычек другого типа
var_str6 = 'The"re'  # строка с определёнными данными, с использование кавычек другого типа
var_str7 = """he"re'"""  # строка с определёнными данными, с использование глобальных внешних кавычек

# list - список переменных (не обязательно одного типа)
#            0   1   2    3
var_list1 = [12, 16, 0, -100]  # массив переменных
var_list2 = [12, True, 0, -10.00]  # массив переменных

# list - кортеж (неизменяемый тип данных)
#             0   1   2    3
var_tuple1 = (12, 16, 0, -100)  # массив неизменяемых переменных
var_tuple2 = (12, True, 0, -10.00)  # массив неизменяемых переменных

# dict - словарь (key-value) (пара: ключ/значение)
var_dict1 = {
    "first key": -10.00,
}

var_dict2 = {
    "first key": -10.00,
    "second key": "Иван",
    "third key": [12, True, 0, -10.00],
    "five key": {
        "first key": "Иван",
        "second key": "Иван",
        "third key": [12, True, 0, -10.00],
        "five key": "Иван",
    },
}

# контанта - "неизменяемый тип данных"
VAR_TUPLE = 12  # условно-неизменяемая

var_1 = True
print(type(var_1))

var_2 = 12
print(type(var_2))

var_3 = 12.0
print(type(var_3))

var_4 = [12.0, 0]
print(type(var_4))
